Ran Plan for 2 projects:

1. dir: `deployment/cloud` workspace: `default`
1. dir: `deployment/service/fta-users` workspace: `default`
---

### 1. dir: `deployment/cloud` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d deployment/cloud
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://fta-mstr-gce-atlantis:4141/lock?id=greyhats13%252Ffta_iac%252Fdeployment%252Fcloud%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d deployment/cloud
  ```

---
### 2. dir: `deployment/service/fta-users` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.terraform_remote_state.cloud_deployment: Reading...
data.terraform_remote_state.cloud_deployment: Read complete after 0s
data.google_kms_secret.secrets["docker_username"]: Reading...
data.google_kms_secret.secrets["docker_password"]: Reading...
data.google_kms_secret.secrets["docker_username"]: Read complete after 0s [id=projects/fta-platform/locations/global/keyRings/fta-mstr-kms-main-keyring/cryptoKeys/fta-mstr-kms-main-cryptokey:CiQAVucnPpO3+dUqGbG7KdfdueCDpSsA+meJNdAkPIGDxQRQNxASMwA4ny4N5APvPvsboBth6dp+lR9KpJr+KZoZbnGj/habtlweC1e5PQv6sAwpmyk9ojjgcw==]
data.google_kms_secret.secrets["docker_password"]: Read complete after 0s [id=projects/fta-platform/locations/global/keyRings/fta-mstr-kms-main-keyring/cryptoKeys/fta-mstr-kms-main-cryptokey:CiQAVucnPifGB4MnNecmYsCnSxQRCzbIKukxHQhwRLyT+w1fCksSMgA4ny4NSUtvTYgl066O+xac6ufobge5fSoHJPxeB4DjyCmRZZW+nGio1opHT6dhTCh7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.repo_users.github_actions_environment_secret.secret["GITOPS_SSH_PRIVATE_KEY"] will be created
+ resource "github_actions_environment_secret" "secret" {
      + created_at      = (known after apply)
      + environment     = "fta_svc_users_dev"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "fta_svc_users"
      + secret_name     = "GITOPS_SSH_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # module.repo_users.github_actions_environment_secret.secret["docker_password"] will be created
+ resource "github_actions_environment_secret" "secret" {
      + created_at      = (known after apply)
      + environment     = "fta_svc_users_dev"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "fta_svc_users"
      + secret_name     = "docker_password"
      + updated_at      = (known after apply)
    }

  # module.repo_users.github_actions_environment_secret.secret["docker_username"] will be created
+ resource "github_actions_environment_secret" "secret" {
      + created_at      = (known after apply)
      + environment     = "fta_svc_users_dev"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "fta_svc_users"
      + secret_name     = "docker_username"
      + updated_at      = (known after apply)
    }

  # module.repo_users.github_branch.dev[0] will be created
+ resource "github_branch" "dev" {
      + branch        = "dev"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "fta_svc_users"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.repo_users.github_repository.repo[0] will be created
+ resource "github_repository" "repo" {
      + allow_auto_merge                        = false
      + allow_merge_commit                      = true
      + allow_rebase_merge                      = true
      + allow_squash_merge                      = true
      + allow_update_branch                     = false
      + archive_on_destroy                      = false
      + archived                                = false
      + auto_init                               = true
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = false
      + etag                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + gitignore_template                      = "Node"
      + has_discussions                         = true
      + has_downloads                           = true
      + has_issues                              = true
      + has_projects                            = true
      + has_wiki                                = true
      + homepage_url                            = "false"
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + is_template                             = false
      + license_template                        = "apache-2.0"
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "fta_svc_users"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = [
          + "docker",
          + "gcp",
          + "kubernetes",
          + "nodejs",
          + "postgresql",
          + "service",
        ]
      + visibility                              = "public"
      + vulnerability_alerts                    = true
      + web_commit_signoff_required             = false

      + security_and_analysis {
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # module.repo_users.github_repository_environment.environment[0] will be created
+ resource "github_repository_environment" "environment" {
      + can_admins_bypass   = true
      + environment         = "fta_svc_users_dev"
      + id                  = (known after apply)
      + prevent_self_review = false
      + repository          = "fta_svc_users"
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d deployment/service/fta-users
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://fta-mstr-gce-atlantis:4141/lock?id=greyhats13%252Ffta_iac%252Fdeployment%252Fservice%252Ffta-users%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d deployment/service/fta-users
  ```
Plan: 6 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 1 with changes, 1 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```